[
	{
		"slug": "evolution-of-indian-constitution-basic-structure",
		"title": "Evolution of Indian Constitution & Basic Structure - Landmark Judgments (1951-2021)",
		"excerpt": "The Story of India's Living Constitution - How Courts Protected the Constitution's Soul through landmark judgments that shaped the Basic Structure Doctrine.",
		"content": "The Indian Constitution is a living document that has evolved over the decades through judicial interpretation and constitutional amendments. The Basic Structure Doctrine, one of the most significant contributions of the Indian judiciary, emerged as a safeguard against unlimited amending power of Parliament.\n\n## Introduction\n\nThe Indian Constitution stands as a testament to the vision of its framers, designed to be both flexible and enduring. However, the question of how far Parliament could go in amending the Constitution led to one of the most important legal doctrines in Indian constitutional law - the Basic Structure Doctrine.\n\n## Landmark Decisions\n\n### 1. Shankari Prasad v. Union of India (1951)\nThe Supreme Court held that Parliament could amend Fundamental Rights under Article 368. This decision established the initial understanding that the amending power was unlimited.\n\n### 2. Sajjan Singh v. State of Rajasthan (1965)\nThe Court reaffirmed Parliament's wide amending power, including the power to amend Fundamental Rights.\n\n### 3. Golaknath v. State of Punjab (1967)\nIn a significant shift, the Court held that Parliament could not amend Fundamental Rights, as such power was not granted under Article 368.\n\n### 4. Kesavananda Bharati v. State of Kerala (1973)\nThis landmark case gave birth to the Basic Structure Doctrine. The Court held that while Parliament could amend the Constitution, it could not alter its basic structure. This decision established that certain core features of the Constitution were beyond the reach of the amending power.\n\n### 5. Indira Nehru Gandhi v. Raj Narain (1975)\nThe Court held that judicial review and democracy were part of the Basic Structure, further expanding the doctrine.\n\n### 6. Minerva Mills v. Union of India (1980)\nThe Court reaffirmed that limited amending power itself was part of the Basic Structure and emphasized the balance between Fundamental Rights and Directive Principles.\n\n### 7. Waman Rao v. Union of India (1981)\nThe Court clarified that all amendments made before Kesavananda (1973) were valid, but later ones would be subject to the Basic Structure test.\n\n### 8. Indra Sawhney v. Union of India (1992)\nThe Court upheld reservation policies while reaffirming that the rule of equality was part of the Basic Structure.\n\n### 9. S.R. Bommai v. Union of India (1994)\nThe Court held that federalism, secularism, and democracy formed part of the Basic Structure.\n\n### 10. I.R. Coelho v. State of Tamil Nadu (2007)\nThe Court held that any law placed in the Ninth Schedule after 1973 would be open to judicial review if it violated the Basic Structure.\n\n### 11. Supreme Court Advocates-on-Record Association v. Union of India (2015)\nThe Court struck down the NJAC Act, holding that judicial independence was part of the Basic Structure.\n\n### 12. Union of India v. Rajendra N. Shah (2021)\nThe Court struck down parts of the 97th Amendment, linking cooperative societies' autonomy to federalism, a Basic Structure feature.\n\n## Conclusion\n\nThe Basic Structure Doctrine has played a crucial role in ensuring that constitutional amendments remain reformative rather than destructive. It has safeguarded India's democratic, secular, and federal character, with the judiciary serving as the guardian of constitutional values. The evolution of this doctrine through landmark judgments demonstrates the dynamic nature of constitutional interpretation and the judiciary's role in protecting the soul of the Constitution.",
		"image": "/blog/evolution-of-indian-constitution.webp",
		"thumbnail": "/blog/evolution-of-indian-constitution-thumb.webp",
		"date": "2024-01-15",
		"author": "LawChanakyas Editorial Team"
	}
]

